// import React from "react";
// import '../Designs/about.css';

// const AboutComponent = () => {
//     return (
//         <div className="about-container">
//             <div className="about-header">
//             <h4>CoHousing- דיור משותף</h4>
//                 <p className="about-description">
//                     מערכת CoHousing נועדה לשרת את ועדי הבית ודיירי הבניין בניהול הבית המשותף.<br></br>
//                     עבור ועד הבית, ניהול הבית המשותף הינו מטלה לא פשוטה.<br></br>
//                     החל משמירה על תחזוקה נאותה של הבניין, מתן מענה לדיירים לגבי שטחים משותפים,<br></br>
//                     וכולה באיסוף תשלום ועד הבית.
//                 </p>
//             </div>
//             <div className="common-issues">
//                 <h4>שתי הטענות העיקריות:</h4>
//                 <p>
//                     <strong>מוועד הבית</strong> – מטלת איסוף דמי ועד הבית מהדיירים היא מטלה בלתי נסבלת המקשה מאוד על ניהול ועד הבית.
//                 </p>
//                 <p>
//                     <strong>ומהדיירים</strong>
//                     – אין לדיירים מושג אלו הוצאות יש לבניין, ומלבד העובדה שהם יודעים שע"פ חוק יש לשלם את ועד הבית,<br></br>
//                     הם מאוד מתוסכלים כאשר נדרשים לתשלומים מעבר לדמי ועד הבית הקבועים.
//                 </p>
//             </div>
//             <div className="system-capabilities">
//                 <h4>יכולות המערכת:</h4>
//                 <div>
//                     <p>ניהול הוצאות הבניין בצורה מסודרת.</p>
//                     <p>ניהול החשבון של כל אחד מהשכנים בבניין, צפיה ביתרה ותשלומים.</p>
//                     <p>צפייה של הדיירים בהוצאות והכנסות של הבניין, וכן בהצעות הבניין.</p>
//                     <p>אפשרות להעלאת הצעה לשיפור וייעול לכל אחד מהדיירים, כאשר רוב השכנים הצביעו בעד,<br></br>
//                      ההצעה מתקבלת ולוועד הבית נותר רק לחתום עליה.</p>
//                     <p>ניהול הדיירים - הוספה והסרה של דיירים מהמערכת, ניהול סיסמאות הדיירים.</p>
//                     <p>ניהול אנשי הועד - הוספה והסרה של אנשי הועד, העברת ניהול הבית מדייר אחד למשנהו.</p>
//                     <p>סטטוס משוערך של מצב חשבון הבנק (ללא התאמות) של הבניין.</p>
//                 </div>
//             </div>
//         </div>
//     );
// };

// export default AboutComponent;

import React from "react";
import '../Designs/about.css';

const AboutComponent = () => {
    return (
        <div className="about-container">
            <div className="text-container">
                <div className="about-header">
                    <h4>CoHousing דיור משותף</h4>
                    <p className="about-description">
                        מערכת CoHousing נועדה לשרת את ועדי הבית ודיירי הבניין בניהול הבית המשותף.<br></br>
                        עבור ועד הבית, ניהול הבית המשותף הינו מטלה לא פשוטה.<br></br>
                        החל משמירה על תחזוקה נאותה של הבניין, מתן מענה לדיירים לגבי שטחים משותפים,<br></br>
                        וכולה באיסוף תשלום ועד הבית.
                    </p>
                </div>
                <div className="common-issues">
                    <h4>שתי הטענות העיקריות:</h4>
                    <p>
                        <strong>מוועד הבית</strong> – מטלת איסוף דמי ועד הבית מהדיירים היא מטלה בלתי נסבלת המקשה מאוד על ניהול ועד הבית.
                    </p>
                    <p>
                        <strong>ומהדיירים</strong>
                        – אין לדיירים מושג אלו הוצאות יש לבניין, ומלבד העובדה שהם יודעים שע"פ חוק יש לשלם את ועד הבית,<br></br>
                        הם מאוד מתוסכלים כאשר נדרשים לתשלומים מעבר לדמי ועד הבית הקבועים.
                    </p>
                </div>
                <div className="system-capabilities">
                    <h4>יכולות המערכת:</h4>
                    <div>
                        <p>ניהול הוצאות הבניין בצורה מסודרת.</p>
                        <p>ניהול החשבון של כל אחד מהשכנים בבניין, צפיה ביתרה ותשלומים.</p>
                        <p>צפייה של הדיירים בהוצאות והכנסות של הבניין, וכן בהצעות הבניין.</p>
                        <p>אפשרות להעלאת הצעה לשיפור וייעול לכל אחד מהדיירים, כאשר רוב השכנים הצביעו בעד,<br></br>
                         ההצעה מתקבלת ולוועד הבית נותר רק לחתום עליה.</p>
                        <p>ניהול הדיירים - הוספה והסרה של דיירים מהמערכת, ניהול סיסמאות הדיירים.</p>
                        <p>ניהול אנשי הועד - הוספה והסרה של אנשי הועד, העברת ניהול הבית מדייר אחד למשנהו.</p>
                        <p>סטטוס משוערך של מצב חשבון הבנק (ללא התאמות) של הבניין.</p>
                    </div>
                </div>
            </div>
            <div className="image-container">
                <img src="/about.jpg" alt="Logo" className="about-image"/>
            </div>
        </div>
    );
};

export default AboutComponent;
